pdlsurya/nRF52/mySdFat/mySdFat.c
/**
 * @file mySdFat.c
 * @author Surya Poudel (poudel.surya2011@gmail.com)
 * @brief FAT32 driver for SD/MMC Card
 * @version 1.0
 * @date 2023-05-08
 *
 * @copyright Copyright(c) 2023, Surya Poudel
 */

#include "mySdFat.h"
#include "SD_driver.h"
#include <stdint.h>
#include "stdlib.h"
#include "string.h"
#include "debug_log.h"
#include "nrf_delay.h"

#define BOOT_SEC_START 0x00002000
#define FSInfo_SEC 0x00002001

#define ATTR_READ_ONLY 0x01
#define ATTR_HIDDEN 0x02
#define ATTR_SYSTEM 0x04
#define ATTR_VOLUME_ID 0x08
#define ATTR_DIRECTORY 0x10
#define ATTR_ARCHIVE 0x20
#define ATTR_LONG_FILE_NAME 0x0F

#define ATTR_LONG_NAME_MASK (ATTR_READ_ONLY | ATTR_HIDDEN | ATTR_SYSTEM | ATTR_VOLUME_ID | ATTR_DIRECTORY | ATTR_ARCHIVE)

#define FAT_EOC 0x0FFFFFF8

bootSecParams_t params;
uint8_t SD_buff[512];

uint32_t FatStartSector;
uint32_t FatSectorsCnt;

uint32_t RootDirStartSector;
uint32_t RootDirSectors;

uint32_t DataStartSector;
uint32_t DataSectorsCnt;

char fileName[128] = "";
uint8_t fileNameIndex;
/**
 * @brief Get the Boot Sectore params
 * @return true
 * @return false
 */
static bool getBootSecParams()
{
    if (SD_readSector(BOOT_SEC_START, SD_buff) == SD_READ_SUCCESS)
    {

        params.BPB_BytesPerSec = (uint16_t)SD_buff[11];
        params.BPB_BytesPerSec |= (uint16_t)(SD_buff[12] << 8);

        params.BPB_SecPerClus = SD_buff[13];

        params.BPB_RsvdSecCnt = (uint16_t)SD_buff[14];
        params.BPB_RsvdSecCnt |= ((uint16_t)SD_buff[15]) << 8;

        params.BPB_TotSec32 = ((uint32_t)SD_buff[32]);
        params.BPB_TotSec32 |= ((uint32_t)SD_buff[33]) << 8;
        params.BPB_TotSec32 |= ((uint32_t)SD_buff[34]) << 16;
        params.BPB_TotSec32 |= ((uint32_t)SD_buff[35]) << 24;

        params.BPB_FATSz32 = ((uint32_t)SD_buff[36]);
        params.BPB_FATSz32 |= ((uint32_t)SD_buff[37]) << 8;
        params.BPB_FATSz32 |= ((uint32_t)SD_buff[38]) << 16;
        params.BPB_FATSz32 |= ((uint32_t)SD_buff[39]) << 24;

        params.BPB_RootEntCnt = (uint16_t)SD_buff[17];
        params.BPB_RootEntCnt |= ((uint16_t)SD_buff[18]) << 8;

        params.BPB_NumFATs = SD_buff[16];

        params.BPB_RootClus = ((uint32_t)SD_buff[44]);
        params.BPB_RootClus |= ((uint32_t)SD_buff[45]) << 8;
        params.BPB_RootClus |= ((uint32_t)SD_buff[46]) << 16;
        params.BPB_RootClus |= ((uint32_t)SD_buff[47]) << 24;

        params.BPB_FSInfo = (uint16_t)(SD_buff[48]);
        params.BPB_FSInfo |= ((uint16_t)(SD_buff[49])) << 8;

        memcpy(params.BS_VolLab, &SD_buff[71], 11);
        params.BS_VolLab[8] = '\0';

        return true;
    }
    return false;
}

/**
 * @brief Get the FAT type
 *
 * @return FATtype
 */

static FATtype getFatType()
{
    uint32_t clusterCnt = DataSectorsCnt / params.BPB_SecPerClus;

    if (clusterCnt <= 4085)
        return FAT12;

    else if (clusterCnt >= 4086 && clusterCnt <= 65525)
        return FAT16;

    else
        return FAT32;
}

/**
 * @brief  get FAT entry location strcuture(Sector number and offset)
 *
 * @param[in] fat_entry_index  entry index of FAT table
 *
 */
static fatEntLoc_t fatEntLocation(uint32_t fat_entry_index)
{
    fatEntLoc_t fatEntLoc;
    fatEntLoc.fatSecNum = FatStartSector + (fat_entry_index * 4 / params.BPB_BytesPerSec);
    fatEntLoc.fatEntOffset = (fat_entry_index * 4) % params.BPB_BytesPerSec;
    return fatEntLoc;
}

/**
 * @brief  Function to get the next cluster
 *
 * @param[in] fatThisClus Current cluster index
 * @return next cluster
 */
static uint32_t fatNextClus(uint32_t fatThisClus)
{
    uint32_t temp;
    fatEntLoc_t fatEntLoc = fatEntLocation(fatThisClus);
    SD_readSector(fatEntLoc.fatSecNum, SD_buff);
    temp = *((uint32_t *)&SD_buff[fatEntLoc.fatEntOffset]);

    return temp;
}

static void fatSetNextClus(uint32_t fatThisClus, uint32_t fatNextClus)
{
    uint32_t *p_temp;
    fatEntLoc_t fatEntLoc = fatEntLocation(fatThisClus);
    SD_readSector(fatEntLoc.fatSecNum, SD_buff);
    p_temp = ((uint32_t *)&SD_buff[fatEntLoc.fatEntOffset]);
    memcpy(p_temp, &fatNextClus, 4);
    SD_writeSector(fatEntLoc.fatSecNum, SD_buff);
}

static uint32_t startSecOfClus(uint32_t cluster_index)
{
    return (DataStartSector + (cluster_index - 2) * params.BPB_SecPerClus);
}

static void displayTime(uint16_t time)
{
    uint8_t hours = (time & 0xF800) >> 11;
    uint8_t minutes = (time & 0x07E0) >> 5;
    uint8_t seconds = (time & 0x001F) * 2;
    debug_log_print(hours > 10 ? "%d" : "0%d", hours);
    debug_log_print(":");
    debug_log_print(minutes > 10 ? "%d" : "0%d", minutes);
    debug_log_print(":");
    debug_log_print(seconds > 10 ? "%d" : "0%d", seconds);
}

static void displayDate(uint16_t date)
{
    uint16_t year = 1980;
    year += (date & 0xF700) >> 9;
    uint8_t month = (date & 0x01E0) >> 5;
    uint8_t day = (date & 0x001F);
    debug_log_print("%d", year);
    debug_log_print("-");
    debug_log_print(month < 10 ? "0%d" : "%d", month);
    debug_log_print("-");
    debug_log_print(day < 10 ? "0%d" : "%d", month);
}

static void getShortFileName(myFile p_file)
{
    uint8_t nameIndx = 0;
    for (uint8_t index = 0; index < 8; index++)
    {
        if (p_file.DIR_Name[index] == ' ')
            break;

        if (p_file.DIR_NTRes & 0x08)
        {
            if ((p_file.DIR_Name[index] > 64) && (p_file.DIR_Name[index] < 91))
            {
                fileName[nameIndx++] = p_file.DIR_Name[index] + 32;
            }
            else
                fileName[nameIndx++] = p_file.DIR_Name[index];
        }

        else
            fileName[nameIndx++] = p_file.DIR_Name[index];
    }
    if ((p_file.DIR_attr & ATTR_DIRECTORY) == 0)
    {
        if (p_file.DIR_ext[0] != ' ')
        {
            fileName[nameIndx++] = '.';
            for (uint8_t index = 0; index < 3; index++)
                fileName[nameIndx++] =
                    (p_file.DIR_ext[index] == ' ') ? '\0' : p_file.DIR_ext[index] + 32;
        }
    }
}

uint32_t startCluster(myFile file)
{
    uint32_t startClus = (uint32_t)file.DIR_FstClusLO;
    startClus |= ((uint32_t)(file.DIR_FstClusHI)) << 16;
    return startClus;
}

static inline bool isFreeEntry(myFile file)
{
    return ((uint8_t)(file.DIR_Name[0]) == 0xE5) ? true : false;
}

