pdlsurya/nRF52/mySdFat/mySdFat.c
bool isDirectory(myFile file)
{
    return (((file.DIR_attr & (ATTR_DIRECTORY | ATTR_VOLUME_ID)) == 0)) ? false : true;
}

bool isEndOfDir(myFile file)
{
    return ((uint8_t)(file.DIR_Name[0]) == 0) ? true : false;
}

bool isValidFile(myFile file)
{
    if (isEndOfDir(file) || (fileName[0] == '.' && fileName[1] == '_'))
        return false;

    return true;
}

static bool LFN_Entry(myFile file)
{
    if (((file.DIR_attr & ATTR_LONG_NAME_MASK) == ATTR_LONG_FILE_NAME) && (((uint8_t)file.DIR_Name[0] & 0xF0) == 0x40))
        return true;
    return false;
}

uint8_t fileLfnEntCnt(myFile *p_file)
{
    return p_file->fileEntInf.LFN_EntCnt;
}

uint32_t fileSize(myFile *p_file)
{
    return p_file->DIR_FileSize;
}

myFile rootDir()
{
    SD_readSector(startSecOfClus(params.BPB_RootClus), SD_buff);
    myFile rootDir = *((myFile *)&SD_buff[0]);
    rootDir.DIR_FstClusLO = 2;
    rootDir.entryIndex = 1;

    return rootDir;
}
/**
 * @brief function to get next file in the folder
 *
 * @param[in] p_file  pointer to the folder
 * @return next file in the folder
 */
myFile nextFile(myFile *p_file)
{
    uint8_t sectorIndex = (p_file->entryIndex / 16) % params.BPB_SecPerClus;
    uint32_t currentClus = startCluster(*p_file);
    myFile temp = {0};

    uint32_t currentClusterIndex = (p_file->entryIndex / (16 * params.BPB_SecPerClus));

    for (uint8_t i = 0; i < currentClusterIndex; i++)
    {
        currentClus = fatNextClus(currentClus);
        if (currentClus >= FAT_EOC)
        {
            p_file->entryIndex = 2;
            memset(&temp, 0, sizeof(myFile));
            return temp;
        }
    }

    if (p_file->entryIndex <= 2)
    {
        sectorIndex = 0;
        currentClus = startCluster(*p_file);
    }

    if (!isDirectory(*p_file))
    {
        debug_log_print("Not a Dir");
        memset(&temp, 0, sizeof(myFile));
        return temp;
    }

    while (1)
    {

        SD_readSector(startSecOfClus(currentClus) + sectorIndex, SD_buff);

        temp = *((myFile *)(SD_buff + (p_file->entryIndex % 16) * 32));

        if (!isFreeEntry(temp))
        {
            if (isEndOfDir(temp))
            {
                memset(&temp, 0, sizeof(myFile));
                return temp;
            }

            if (LFN_Entry(temp))
            {

                memset(fileName, 0, sizeof(fileName));
                uint8_t LFN_entryCnt = ((((LFN_entry_t *)&temp)->LDIR_Ord) & 0x0F);
                uint8_t lfnEntCntTemp = LFN_entryCnt;
                char tempName[LFN_entryCnt][13];
                while (LFN_entryCnt)
                {
                    uint8_t tempNameIndex;
                    LFN_entry_t *entry = (LFN_entry_t *)(SD_buff + (p_file->entryIndex % 16) * 32);

                    for (uint8_t i = 0; i < 10; i += 2)
                        tempName[LFN_entryCnt - 1][tempNameIndex++] =
                            entry->LDIR_Name1[i];

                    for (uint8_t i = 0; i < 12; i += 2)
                        tempName[LFN_entryCnt - 1][tempNameIndex++] =
                            entry->LDIR_Name2[i];

                    for (uint8_t i = 0; i < 4; i += 2)
                        tempName[LFN_entryCnt - 1][tempNameIndex++] =
                            entry->LDIR_Name3[i];

                    LFN_entryCnt--;
                    tempNameIndex = 0;
                    p_file->entryIndex++;

                    if ((p_file->entryIndex % 16) == 0)
                    {
                        sectorIndex++;

                        if (sectorIndex == params.BPB_SecPerClus)
                        {
                            sectorIndex = 0;
                            currentClus = fatNextClus(currentClus);
                            if (currentClus >= FAT_EOC)
                            {
                                p_file->entryIndex = 2;
                                memset(&temp, 0, sizeof(myFile));
                                return temp;
                            }
                        }

                        SD_readSector(startSecOfClus(currentClus) + sectorIndex,
                                      SD_buff);
                    }
                }

                char *p_name = (char *)tempName;

                // Copy filename to fileName global string buffer.
                while ((*p_name) != '\0')
                    fileName[fileNameIndex++] = *(p_name++);

                fileNameIndex = 0;

                temp = *((myFile *)(SD_buff + (p_file->entryIndex % 16) * 32));
                temp.fileEntInf.Cluster = currentClus;
                temp.fileEntInf.sectorIndex = sectorIndex;
                temp.fileEntInf.entryIndex = p_file->entryIndex % 16;
                temp.fileEntInf.LFN_EntCnt = lfnEntCntTemp;
                p_file->entryIndex++;

                if (p_file->entryIndex % 16 == 0)
                    sectorIndex++;
                break;
            }
            else
            {
                memset(fileName, 0, sizeof(fileName));
                getShortFileName(temp);
                temp.fileEntInf.Cluster = currentClus;
                temp.fileEntInf.sectorIndex = sectorIndex;
                temp.fileEntInf.entryIndex = p_file->entryIndex % 16;
                temp.fileEntInf.LFN_EntCnt = 0;

                p_file->entryIndex++;

                if (p_file->entryIndex % 16 == 0)
                    sectorIndex++;

                break;
            }
        }
        else
        {

            p_file->entryIndex++;
            if (p_file->entryIndex % 16 == 0)
                sectorIndex++;
        }

        if (sectorIndex == params.BPB_SecPerClus)
        {
            sectorIndex = 0;
            currentClus = fatNextClus(currentClus);
            if (currentClus >= FAT_EOC)
            {
                p_file->entryIndex = 2;
                memset(&temp, 0, sizeof(myFile));
                return temp;
            }
        }
    }
    if (isDirectory(temp))
        temp.entryIndex = 2;
    else
        temp.entryIndex = 0;

    return temp;
}

