pdlsurya/nRF52/mySdFat/mySdFat.c
static void dispFile(myFile p_file, char *fileName, uint8_t tab)
{
    for (uint8_t i = 0; i < tab; i++)
        debug_log_print("    ");

    debug_log_print("%s", fileName);

    if (isDirectory(p_file))
        debug_log_print("/");
    debug_log_print("     ");

    displayDate(p_file.DIR_WrtDate);

    debug_log_print(" || ");
    displayTime(p_file.DIR_WrtTime);

    debug_log_print(" || ");

    debug_log_print("%d Bytes\n", p_file.DIR_FileSize);
    /*
     debug_log_print(" || ");
     debug_log_print("startClus:");
     debug_log_print(startCluster(p_file));
     */
}

static myFile fileExists(const char *file, myFile folder)
{
    myFile tempFile = {0};

    while (!isEndOfDir(tempFile = nextFile(&folder)))
    {
        uint8_t nameIndx;
        for (nameIndx = 0; nameIndx < strlen(file); nameIndx++)
        {
            if (file[nameIndx] != fileName[nameIndx])
                break;
        }
        if (nameIndx == strlen(file) && nameIndx == strlen(fileName))
            return tempFile;
    }
    memset(&tempFile, 0, sizeof(myFile));
    return tempFile;
}

myFile pathExists(const char *path)
{
    myFile tempFile = rootDir();

    if (strlen(path) == 1 && path[0] == '/')
        return tempFile;

    uint8_t index = 0;
    uint8_t charCnt = 0;
    while (path[charCnt] != '\0')
    {
        char dirName[36] = "";
        for (uint8_t i = index + 1; i < index + 36; i++)
        {
            charCnt++;

            if (path[i] == '/' || path[i] == '\0')
                break;
            dirName[charCnt - index - 1] = path[i];
        }
        index = charCnt;
        tempFile = fileExists(dirName, tempFile);

        if (startCluster(tempFile) == 0)
            return tempFile;
    }

    return tempFile;
}

char *getExtension(char *file_name)
{
    static char ext[5] = "";
    memset(ext, 0, sizeof(ext));
    uint8_t idx = 0;
    while (file_name[idx] != '.')
    {
        idx++;
        if (idx == strlen(file_name))
            return ext;
    }
    strcpy(ext, &file_name[idx + 1]);
    return ext;
}

static bool printContent(uint32_t startClus, uint32_t size)
{
    uint32_t charCnt = 0;

    if (startClus == 0 || size == 0)
        return 0;

    debug_log_print("\n");
    do
    {
        if (SD_readMultipleSecStart(startSecOfClus(startClus)) == SD_READY)
        {
            for (uint8_t i = 0; i < params.BPB_SecPerClus; i++)
            {
                SD_readMultipleSec(SD_buff);
                for (uint16_t c = 0; c < 512; c++)
                {
                    debug_log_print("%c", SD_buff[c]);
                    charCnt++;
                    if (charCnt == size)
                    {
                        SD_readMultipleSecStop();
                        return true;
                    }
                }
            }
        }
        else
        {
            // debug_log_print("Content read failed!");
            return false;
        }
        SD_readMultipleSecStop();
    } while ((startClus = fatNextClus(startClus)) < FAT_EOC);
    return true;
}

void fileClose(myFile *p_file)
{
    memset(p_file, 0, sizeof(myFile));
    SD_readMultipleSecStop();
}

bool isClosed(myFile *p_file)
{
    if ((startCluster(*p_file) == 0) && (p_file->DIR_FileSize == 0))
        return true;
    return false;
}

void fileReset(myFile *p_file)
{
    // stop any on going multiple secotrs read
    SD_readMultipleSecStop();

    // reset index;
    p_file->entryIndex = 0;
}

uint8_t readByte(myFile *p_file)
{
    static bool readStarted = false;
    static uint32_t Cluster = 0xFFFFFFFF;

    if (Cluster == 0xFFFFFFFF)
        Cluster = startCluster(*p_file);

    if (p_file->entryIndex == 0)
    {
        readStarted = false;
        Cluster = startCluster(*p_file);
    }

    if (isClosed(p_file))
    {
        SD_readMultipleSecStop();
        readStarted = false;
        return 0;
    }

    if (!readStarted)
    {
        SD_readMultipleSecStart(startSecOfClus(Cluster));
        SD_readMultipleSec(SD_buff);
        readStarted = true;
    }

    if ((p_file->entryIndex > 0) && (p_file->entryIndex % (params.BPB_SecPerClus * params.BPB_BytesPerSec) == 0))
    {
        SD_readMultipleSecStop();
        Cluster = fatNextClus(Cluster);
        if (Cluster >= FAT_EOC)
        {
            SD_readMultipleSecStop();
            readStarted = false;
            return 0;
        }
        SD_readMultipleSecStart(startSecOfClus(Cluster));
    }

    if (p_file->entryIndex > 0 && (p_file->entryIndex % params.BPB_BytesPerSec == 0))
        SD_readMultipleSec(SD_buff);

    return SD_buff[(p_file->entryIndex++) % params.BPB_BytesPerSec];
}

bool readFile(const char *path, const char *fileName)
{
    myFile tempFile = pathExists(path);
    if (startCluster(tempFile) == 0)
    {
        debug_log_print("Invalid path\n");
        return false;
    }
    tempFile = fileExists(fileName, tempFile);
    if (startCluster(tempFile) == 0)
        return false;

    uint32_t startClus = startCluster(tempFile);
    printContent(startClus, tempFile.DIR_FileSize);
    debug_log_print("\n");

    return true;
}

bool listDir(const char *path)
{
    myFile tempFile = pathExists(path);
    if (startCluster(tempFile) == 0)
    {
        debug_log_print("Invalid Path!\n");
        return false;
    }
    if (!isDirectory(tempFile))
    {

        printContent(startCluster(tempFile), tempFile.DIR_FileSize);
        debug_log_print("\n");

        return true;
    }
    myFile folder = tempFile;

    while (!isEndOfDir(tempFile = nextFile(&folder)))
    {
        if (isValidFile(tempFile))
            dispFile(tempFile, fileName, 0);
    }
    return 1;
}

static void fileSetStartClus(myFile *p_file, uint32_t cluster)
{

    p_file->DIR_FstClusLO = (uint16_t)(cluster & 0x0000FFFF);
    p_file->DIR_FstClusHI = (uint16_t)((cluster & 0xFFFF0000) >> 16);
}

static void fileSetDate(myFile *p_file, uint16_t year, uint8_t month,
                        uint8_t day)
{
    year -= 1980;
    p_file->DIR_WrtDate = day;
    p_file->DIR_WrtDate |= (uint16_t)month << 5;
    p_file->DIR_WrtDate |= year << 9;
}

static void fileSetTime(myFile *p_file, uint8_t hours, uint8_t minutes,
                        uint8_t seconds)
{
    p_file->DIR_WrtTime = (uint16_t)(seconds / 2);
    p_file->DIR_WrtTime |= (uint16_t)minutes << 5;
    p_file->DIR_WrtTime |= (uint16_t)hours << 11;
}

static freeEntInf_t getFreeEntry(myFile Dir, uint8_t freeEntryCnt)
{
    freeEntInf_t frEntInf;
    frEntInf.Cluster = startCluster(Dir);
    do
    {
        if (SD_readMultipleSecStart(startSecOfClus(frEntInf.Cluster)) == SD_READY)
        {
            for (frEntInf.sectorIndex = 0;
                 frEntInf.sectorIndex < params.BPB_SecPerClus;
                 frEntInf.sectorIndex++)
            {
                SD_readMultipleSec(SD_buff);
                for (frEntInf.entryIndex = 0; frEntInf.entryIndex < 16;
                     frEntInf.entryIndex++)
                {
                    myFile temp = *((myFile *)(SD_buff + frEntInf.entryIndex * 32));
                    if (isFreeEntry(temp) || isEndOfDir(temp))
                    {
                        if (isEndOfDir(temp))
                        {
                            SD_readMultipleSecStop();
                            if ((frEntInf.entryIndex + freeEntryCnt) > 15)
                            {
                                SD_readSector(
                                    startSecOfClus(frEntInf.Cluster) + frEntInf.sectorIndex,
                                    SD_buff);
                                for (uint8_t i = frEntInf.entryIndex; i < 16;
                                     i++)
                                {
                                    myFile *p_file = (myFile *)(SD_buff + (i * 32));
                                    p_file->DIR_Name[0] = 0xE5;
                                }
                                SD_writeSector(
                                    startSecOfClus(frEntInf.Cluster) + frEntInf.sectorIndex,
                                    SD_buff);

