pdlsurya/nRF52/mySdFat/mySdFat.c
                                frEntInf.sectorIndex++;
                                frEntInf.entryIndex = 0;
                            }
                            return frEntInf;
                        }

                        if (freeEntryCnt == 1)
                        {
                            SD_readMultipleSecStop();
                            return frEntInf;
                        }
                        uint8_t i;
                        for (i = 0; i < freeEntryCnt; i++)
                        {
                            frEntInf.entryIndex += i;
                            if (frEntInf.entryIndex == 16)
                                break;

                            temp = *((myFile *)(SD_buff + frEntInf.entryIndex * 32));
                            if (!isFreeEntry(temp))
                                break;
                        }
                        if (i != freeEntryCnt)
                            continue;
                        SD_readMultipleSecStop();
                        frEntInf.entryIndex -= (freeEntryCnt - 1);
                        return frEntInf;
                    }
                }
            }
        }
        else
        {
            memset(&frEntInf, 0, sizeof(freeEntInf_t));
            return frEntInf;
        }

        SD_readMultipleSecStop();

    } while ((frEntInf.Cluster = fatNextClus(frEntInf.Cluster)) < FAT_EOC);
    memset(&frEntInf, 0, sizeof(freeEntInf_t));
    return frEntInf;
}

static void get_datetime_numerical(uint16_t *year, uint8_t *month, uint8_t *day,
                                   uint8_t *hour, uint8_t *minute, uint8_t *second)
{
    const char *date_str = __DATE__; // e.g. "Apr 12 2023"
    const char *time_str = __TIME__; // e.g. "23:59:59"
    char *endptr;

    // Parse date string
    char monthStr[4] = {'\0'};
    memcpy(monthStr, date_str, 3);
    if (strcmp(monthStr, "Jan") == 0)
        *month = 1;

    else if (strcmp(monthStr, "Feb") == 0)
        *month = 2;

    else if (strcmp(monthStr, "Mar") == 0)
        *month = 3;

    else if (strcmp(monthStr, "Apr") == 0)
        *month = 4;

    else if (strcmp(monthStr, "May") == 0)
        *month = 5;

    else if (strcmp(monthStr, "Jun") == 0)
        *month = 6;

    else if (strcmp(monthStr, "Jul") == 0)
        *month = 7;

    else if (strcmp(monthStr, "Aug") == 0)
        *month = 8;

    else if (strcmp(monthStr, "Sep") == 0)
        *month = 9;

    else if (strcmp(monthStr, "Oct") == 0)
        *month = 10;

    else if (strcmp(monthStr, "Nov") == 0)
        *month = 11;

    else if (strcmp(monthStr, "Dec") == 0)
        *month = 12;

    *day = strtol(date_str + 4, &endptr, 10);
    *year = strtol(endptr + 1, NULL, 10);

    // Parse time string
    *hour = strtol(time_str, &endptr, 10);
    *minute = strtol(endptr + 1, &endptr, 10);
    *second = strtol(endptr + 1, NULL, 10);
}

static uint8_t fileNameLength(const char *filename)
{

    uint8_t i;
    for (i = 0; i < strlen(filename); i++)
    {
        if (filename[i] == '.')
            break;
    }
    return i;
}

static bool allLowerCase(const char *filename)
{
    for (uint8_t i = 0; i < fileNameLength(filename); i++)
    {
        if ((((uint8_t)filename[i]) < 91) && (((uint8_t)filename[i]) > 64))
        {
            return false;
        }
    }
    return true;
}

static bool mixedLetters(const char *filename)
{
    if (!allLowerCase(filename))
    {
        for (uint8_t i = 0; i < fileNameLength(filename); i++)
        {
            if (((uint8_t)filename[i] > 96))
            {
                return true;
            }
        }
    }
    return false;
}

static uint8_t create_sum(myFile *entry)
{
    uint8_t i;
    uint8_t Sum = 0;

    for (i = 0; i < 8; i++)
    { /* Calculate sum of DIR_Name[] field */
        Sum = (Sum >> 1) + (Sum << 7) + (uint8_t)entry->DIR_Name[i];
    }
    for (i = 0; i < 3; i++)
    { /* Calculate sum of DIR_ext[]] field */
        Sum = (Sum >> 1) + (Sum << 7) + (uint8_t)entry->DIR_ext[i];
    }
    return Sum;
}

static bool updateFSInfo(uint32_t nxtFreeClus)
{
    if (SD_readSector(FSInfo_SEC, SD_buff) == SD_READ_SUCCESS)
    {
        FSInfo_t *p_fsinfo = (FSInfo_t *)SD_buff;
        p_fsinfo->FSI_Nxt_Free = nxtFreeClus;
        p_fsinfo->FSI_Free_Count--;

        if (SD_writeSector(FSInfo_SEC, SD_buff) == SD_WRITE_SUCCESS)
            return true;
        else
            return false;
    }
    return false;
}

static uint32_t getNxtFreeClus()
{
    if (SD_readSector(FSInfo_SEC, SD_buff) == SD_READ_SUCCESS)
    {

        FSInfo_t *p_fsinfo = (FSInfo_t *)SD_buff;
        uint32_t nxtFreeClus = p_fsinfo->FSI_Nxt_Free;

        while (fatNextClus(nxtFreeClus) != 0x00000000)
            nxtFreeClus++;

        if (updateFSInfo(nxtFreeClus))
        {
            return nxtFreeClus;
        }
        else
            return 0xFFFFFFFF;
    }
    else
        return 0xFFFFFFFF;
}

static myFile createFile(const char *path, const char *filename, bool isDir)
{
    myFile pathDir;

    myFile tempFile = pathExists(path);
    if (startCluster(tempFile) == 0)
    {
        debug_log_print("Invalid path!");
        return tempFile;
    }

    pathDir = tempFile;

    tempFile = fileExists(filename, pathDir);

    if (startCluster(tempFile) != 0)
    {
        debug_log_print("File exists!");
        tempFile.entryIndex = 0;
        return tempFile;
    }

    myFile newFile = {0};

    uint32_t fileStartClus = getNxtFreeClus();
    fileSetStartClus(&newFile, fileStartClus);
    fatSetNextClus(fileStartClus, FAT_EOC);

    uint8_t tempIndx = 0;
    memset(newFile.DIR_Name, ' ', 8);
    memset(newFile.DIR_ext, ' ', 3);

    freeEntInf_t frEnt;

    if (mixedLetters(filename) || (fileNameLength(filename) > 8))
    {
        for (uint8_t i = 0; i < strlen(filename); i++)
        {
            if (filename[i] == '.')
            {
                tempIndx = i + 1;
                break;
            }
            if (i < 8)
            {
                if ((filename[i] > 96) && (filename[i] < 123))
                    newFile.DIR_Name[i] = filename[i] - 32;
                else
                    newFile.DIR_Name[i] = filename[i];
            }
            if (fileNameLength(filename) > 8)
            {
                newFile.DIR_Name[6] = '~';
                newFile.DIR_Name[7] = '1';
            }
        }
        for (uint8_t i = 0; i < 3; i++)
        {
            if (filename[tempIndx + i] == '\0')
                break;
            newFile.DIR_ext[i] = filename[tempIndx + i] - 32;
        }
        uint8_t lfnEntCnt = strlen(filename) / 13;
        newFile.fileEntInf.LFN_EntCnt = lfnEntCnt;

        if ((strlen(filename) % 13) != 0)
            lfnEntCnt += 1;

