pdlsurya/nRF52/mySdFat/mySdFat.c
        uint8_t nameIndex = 0;
        uint8_t temp = lfnEntCnt;

        frEnt = getFreeEntry(pathDir, lfnEntCnt + 1);
        SD_readSector(startSecOfClus(frEnt.Cluster) + frEnt.sectorIndex,
                      SD_buff);

        while (lfnEntCnt)
        {
            LFN_entry_t *entry = (LFN_entry_t *)(SD_buff + (frEnt.entryIndex + lfnEntCnt - 1) * 32);
            entry->LDIR_Attr = ATTR_LONG_FILE_NAME;
            entry->LDIR_FstClusLO = 0;
            entry->LDIR_Type = 0;
            entry->LDIR_Ord = temp - lfnEntCnt + 1;
            entry->LDIR_Chksum = create_sum(&newFile);
            memset(entry->LDIR_Name1, 0, 10);
            memset(entry->LDIR_Name2, 0, 12);
            memset(entry->LDIR_Name3, 0, 4);

            if (lfnEntCnt == 1)
                entry->LDIR_Ord |= 0x40;

            for (uint8_t i = 0; i < 10; i += 2)
            {
                if (filename[nameIndex] != 0)
                    entry->LDIR_Name1[i] = filename[nameIndex++];
            }
            for (uint8_t i = 0; i < 12; i += 2)
            {
                if (filename[nameIndex] != 0)
                    entry->LDIR_Name2[i] = filename[nameIndex++];
            }
            for (uint8_t i = 0; i < 4; i += 2)
            {
                if (filename[nameIndex] != 0)
                    entry->LDIR_Name3[i] = filename[nameIndex++];
            }

            lfnEntCnt--;
        }
        frEnt.entryIndex += temp;
    }
    else

    {
        frEnt = getFreeEntry(pathDir, 1);
        SD_readSector(startSecOfClus(frEnt.Cluster) + frEnt.sectorIndex,
                      SD_buff);

        for (uint8_t i = 0; i < 9; i++)
        {
            if (filename[i] == '.')
            {
                tempIndx = i + 1;
                break;
            }

            if ((filename[i] > 96) && (filename[i] < 123))
                newFile.DIR_Name[i] = filename[i] - 32;
            else
                newFile.DIR_Name[i] = filename[i];
        }
        for (uint8_t i = 0; i < 3; i++)
        {
            if (filename[i] == '\0')
                break;
            newFile.DIR_ext[i] = filename[tempIndx + i] - 32;
        }
        newFile.fileEntInf.LFN_EntCnt = 0;
    }
    if (isDir)
        newFile.DIR_attr = ATTR_DIRECTORY;
    else
        newFile.DIR_attr = 0;

    if (allLowerCase(filename))
        newFile.DIR_NTRes = 0x18;
    else
        newFile.DIR_NTRes = 0x10;

    uint16_t year = 0;
    uint8_t month = 0, day = 0, hour = 0, minute = 0, second = 0;
    get_datetime_numerical(&year, &month, &day, &hour, &minute, &second);

    fileSetDate(&newFile, year, month, day);
    fileSetTime(&newFile, hour, minute, second);

    newFile.fileEntInf.Cluster = frEnt.Cluster;
    newFile.fileEntInf.sectorIndex = frEnt.sectorIndex;
    newFile.fileEntInf.entryIndex = frEnt.entryIndex;

    myFile *p_file = (myFile *)(SD_buff + frEnt.entryIndex * 32);
    memcpy(p_file, &newFile, 32);

    if (SD_writeSector(startSecOfClus(frEnt.Cluster) + frEnt.sectorIndex,
                       SD_buff) == SD_WRITE_SUCCESS)
    {
        debug_log_print("File Created!\n");
        return newFile;
    }
    else
    {
        memset(&tempFile, 0, sizeof(myFile));
        return tempFile;
    }
}

myFile fileOpen(const char *path, const char *filename)
{
    return createFile(path, filename, false);
}

myFile createDirectory(const char *path, const char *dirName)
{
    myFile parentDir = pathExists(path);

    if (startCluster(parentDir) == 0)
    {
        debug_log_print("Invalid path!");
        return parentDir;
    }

    myFile thisDir = fileExists(dirName, parentDir);

    if (startCluster(thisDir) != 0)
    {
        // debug_log_print("Folder exists!");
        return thisDir;
    }

    thisDir = createFile(path, dirName, true);

    uint32_t dirStartClus = startCluster(thisDir);

    memset(thisDir.DIR_Name, ' ', 8);
    memset(thisDir.DIR_ext, ' ', 3);
    memset(parentDir.DIR_Name, ' ', 8);
    memset(parentDir.DIR_ext, ' ', 3);

    thisDir.DIR_Name[0] = '.';

    parentDir.DIR_Name[0] = '.';
    parentDir.DIR_Name[1] = '.';

    memset(SD_buff, 0, 512);

    for (uint8_t sectorIndex = 0; sectorIndex < params.BPB_SecPerClus;
         sectorIndex++)
        SD_writeSector(startSecOfClus(dirStartClus) + sectorIndex, SD_buff);

    memcpy(SD_buff, &thisDir, 32);
    memcpy(SD_buff + 32, &parentDir, 32);

    SD_writeSector(startSecOfClus(dirStartClus), SD_buff);

    return thisDir;
}

bool fileWrite(myFile *p_file, const char *data)
{
    uint32_t startClus = startCluster(*p_file);
    uint16_t byteIndex = p_file->DIR_FileSize % 512;
    uint32_t sectorIndex = p_file->DIR_FileSize / 512;
    uint32_t clusterCnt = (sectorIndex / params.BPB_SecPerClus) + 1;
    uint32_t byteCnt = 0;
    bool moreData = true;

    sectorIndex = sectorIndex % params.BPB_SecPerClus;
    uint32_t tempClus;

    if (clusterCnt > 1)
    {
        while (clusterCnt)
        {
            tempClus = startClus;
            startClus = fatNextClus(startClus);
            clusterCnt--;
        }
        uint32_t nextClus = getNxtFreeClus();
        fatSetNextClus(tempClus, nextClus);
        fatSetNextClus(nextClus, FAT_EOC);
    }

    if (byteIndex != 0)
        SD_readSector(startSecOfClus(startClus) + sectorIndex, SD_buff);
    for (uint32_t sector = sectorIndex; sector < params.BPB_SecPerClus;
         sector++)
    {
        for (uint32_t i = byteIndex; i < 512; i++)
        {
            SD_buff[i] = data[byteCnt++];
            if (byteCnt == strlen(data))
            {
                moreData = false;
                break;
            }
        }
        byteIndex = 0;

        if (SD_writeSector(startSecOfClus(startClus) + sector, SD_buff) == SD_WRITE_ERROR)
            return false;

        if (!moreData)
        {
            p_file->DIR_FileSize += strlen(data);

            if (SD_readSector(
                    startSecOfClus(p_file->fileEntInf.Cluster) + p_file->fileEntInf.sectorIndex, SD_buff) == SD_READ_SUCCESS)
            {
                myFile *p_temp = (myFile *)(SD_buff + p_file->fileEntInf.entryIndex * 32);
                memcpy(p_temp, p_file, 32);
                if (SD_writeSector(
                        startSecOfClus(p_file->fileEntInf.Cluster) + p_file->fileEntInf.sectorIndex, SD_buff) == SD_WRITE_SUCCESS)
                    return true;
            }
            return false;
        }
    }
    return true;
}

