pdlsurya/nRF52/mySdFat/mySdFat.c
bool fileDelete(const char *path, const char *filename)
{
    myFile pathDir;

    myFile tempFile = pathExists(path);
    if (startCluster(tempFile) == 0)
    {
        debug_log_print("Invalid path!\n");
        return false;
    }

    pathDir = tempFile;

    tempFile = fileExists(filename, pathDir);

    if (startCluster(tempFile) == 0)
    {
        debug_log_print("File doesnt exists!\n");
        return false;
    }

    uint8_t lfnEntCnt = 0;
    if (mixedLetters(filename) || (fileNameLength(filename) > 8))
    {
        lfnEntCnt = strlen(filename) / 13;
        if ((strlen(filename) % 13) != 0)
            lfnEntCnt += 1;
    }

    if (SD_readSector(
            startSecOfClus(tempFile.fileEntInf.Cluster) + tempFile.fileEntInf.sectorIndex, SD_buff) == SD_READ_SUCCESS)
    {
        for (uint8_t i = 0; i < (lfnEntCnt + 1); i++)
        {
            myFile *p_temp = (myFile *)(SD_buff + (tempFile.fileEntInf.entryIndex - i) * 32);
            p_temp->DIR_Name[0] = 0xE5;
        }

        if (SD_writeSector(
                startSecOfClus(tempFile.fileEntInf.Cluster) + tempFile.fileEntInf.sectorIndex, SD_buff) == SD_WRITE_SUCCESS)
        {
            uint32_t fileClus = startCluster(tempFile);
            uint32_t tempClus;
            while (fileClus < FAT_EOC)
            {
                tempClus = fileClus;
                fileClus = fatNextClus(fileClus);
                fatSetNextClus(tempClus, 0x00000000);
            }
            // updateFSInfo(startCluster(tempFile));
            return true;
        }
        return false;
    }
    return false;
}

/**
 * @brief Funtion to initialize SD Cart and FAT parameters.
 * @return true/fasle returns true upon successful initialization;Otherse returs false.
 */
bool mySdFat_init()
{

    if (SD_init() == SD_INIT_ERROR)
        return false;

    if (getBootSecParams())
    {

        FatStartSector = BOOT_SEC_START + params.BPB_RsvdSecCnt; // 0X2020

        FatSectorsCnt = params.BPB_FATSz32 * params.BPB_NumFATs;

        RootDirStartSector = FatStartSector + FatSectorsCnt;

        RootDirSectors = (32 * params.BPB_RootEntCnt + params.BPB_BytesPerSec - 1) / params.BPB_BytesPerSec; // 0 for FAT32

        DataStartSector = RootDirStartSector + RootDirSectors; // 0X96AE

        DataSectorsCnt = params.BPB_TotSec32 - DataStartSector;

        float size = (params.BPB_TotSec32 * 512.0) / (1024.0 * 1024.0 * 1024.0);
        uint16_t sizeInt = size;
        float tmpFrac = size - sizeInt;
        uint16_t tmpInt = tmpFrac * 100;

        debug_log_print("Card Size=%d.%d GB\n", sizeInt, tmpInt);

        debug_log_print("FAT type is: ");
        switch (getFatType())
        {
        case FAT12:
            debug_log_print("FAT12\n");
            break;
        case FAT16:
            debug_log_print("FAT16\n");
            break;

        case FAT32:
            debug_log_print("FAT32\n");
            break;

        default:
            break;
        }

        debug_log_print("Volume Label: %s\n", params.BS_VolLab);

        return true;
    }
    return false;
}
